data/Section 5/5.2/Client/VM1_Instance2/rep3/output_C2_T1_W64_K6_R3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       41462 ops,     449 (avg:     460) ops/sec, 1.59MB/sec (avg: 1.64MB/sec),  4.43 (avg:  4.33) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         230.35          ---          ---      4.30600       239.21
Gets         230.33      1381.99         0.00      4.34700      1437.93
Waits          0.00          ---          ---      0.00000          ---
Totals       460.69      1381.99         0.00      4.32600      1677.15


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.400         0.00
SET       1.500         0.04
SET       1.600         0.18
SET       1.700         0.69
SET       1.800         1.79
SET       1.900         3.84
SET       2.000         6.53
SET       2.100         9.91
SET       2.200        13.92
SET       2.300        18.34
SET       2.400        22.38
SET       2.500        26.54
SET       2.600        29.97
SET       2.700        33.35
SET       2.800        36.51
SET       2.900        39.18
SET       3.000        41.60
SET       3.100        43.82
SET       3.200        45.79
SET       3.300        47.51
SET       3.400        49.13
SET       3.500        50.62
SET       3.600        51.91
SET       3.700        53.10
SET       3.800        54.42
SET       3.900        55.67
SET       4.000        56.92
SET       4.100        58.17
SET       4.200        59.43
SET       4.300        60.47
SET       4.400        61.70
SET       4.500        62.84
SET       4.600        63.92
SET       4.700        65.21
SET       4.800        66.36
SET       4.900        67.63
SET       5.000        68.87
SET       5.100        70.19
SET       5.200        71.46
SET       5.300        72.66
SET       5.400        74.03
SET       5.500        75.40
SET       5.600        76.58
SET       5.700        77.75
SET       5.800        78.93
SET       5.900        80.22
SET       6.000        81.35
SET       6.100        82.41
SET       6.200        83.41
SET       6.300        84.46
SET       6.400        85.53
SET       6.500        86.42
SET       6.600        87.23
SET       6.700        88.02
SET       6.800        88.75
SET       6.900        89.41
SET       7.000        89.89
SET       7.100        90.42
SET       7.200        90.85
SET       7.300        91.32
SET       7.400        91.73
SET       7.500        92.10
SET       7.600        92.44
SET       7.700        92.80
SET       7.800        93.18
SET       7.900        93.48
SET       8.000        93.84
SET       8.100        94.12
SET       8.200        94.36
SET       8.300        94.57
SET       8.400        94.79
SET       8.500        95.05
SET       8.600        95.27
SET       8.700        95.47
SET       8.800        95.66
SET       8.900        95.84
SET       9.000        96.03
SET       9.100        96.19
SET       9.200        96.31
SET       9.300        96.44
SET       9.400        96.57
SET       9.500        96.72
SET       9.600        96.83
SET       9.700        96.96
SET       9.800        97.10
SET       9.900        97.24
SET      10.000        97.83
SET      11.000        98.45
SET      12.000        98.90
SET      13.000        99.18
SET      14.000        99.36
SET      15.000        99.47
SET      16.000        99.59
SET      17.000        99.67
SET      18.000        99.71
SET      19.000        99.77
SET      20.000        99.81
SET      21.000        99.84
SET      22.000        99.87
SET      23.000        99.89
SET      24.000        99.91
SET      25.000        99.92
SET      27.000        99.94
SET      28.000        99.94
SET      29.000        99.95
SET      39.000        99.96
SET      43.000        99.96
SET      50.000        99.97
SET      51.000        99.98
SET      57.000        99.99
SET      59.000       100.00
SET      62.000       100.00
---
GET       1.700         0.01
GET       1.800         0.09
GET       1.900         0.51
GET       2.000         1.53
GET       2.100         3.69
GET       2.200         6.61
GET       2.300        10.38
GET       2.400        14.74
GET       2.500        19.19
GET       2.600        23.83
GET       2.700        28.60
GET       2.800        32.73
GET       2.900        36.11
GET       3.000        39.48
GET       3.100        42.51
GET       3.200        45.07
GET       3.300        47.27
GET       3.400        49.28
GET       3.500        51.09
GET       3.600        52.64
GET       3.700        54.16
GET       3.800        55.40
GET       3.900        56.68
GET       4.000        57.94
GET       4.100        58.95
GET       4.200        59.94
GET       4.300        60.99
GET       4.400        62.16
GET       4.500        63.40
GET       4.600        64.48
GET       4.700        65.62
GET       4.800        66.76
GET       4.900        67.82
GET       5.000        68.88
GET       5.100        70.08
GET       5.200        71.28
GET       5.300        72.53
GET       5.400        73.77
GET       5.500        75.14
GET       5.600        76.40
GET       5.700        77.53
GET       5.800        78.68
GET       5.900        79.94
GET       6.000        81.28
GET       6.100        82.51
GET       6.200        83.63
GET       6.300        84.82
GET       6.400        85.78
GET       6.500        86.82
GET       6.600        87.81
GET       6.700        88.76
GET       6.800        89.47
GET       6.900        90.13
GET       7.000        90.72
GET       7.100        91.32
GET       7.200        91.85
GET       7.300        92.24
GET       7.400        92.69
GET       7.500        93.11
GET       7.600        93.46
GET       7.700        93.76
GET       7.800        94.05
GET       7.900        94.35
GET       8.000        94.61
GET       8.100        94.88
GET       8.200        95.12
GET       8.300        95.29
GET       8.400        95.48
GET       8.500        95.66
GET       8.600        95.86
GET       8.700        96.02
GET       8.800        96.15
GET       8.900        96.29
GET       9.000        96.42
GET       9.100        96.57
GET       9.200        96.73
GET       9.300        96.81
GET       9.400        96.95
GET       9.500        97.09
GET       9.600        97.22
GET       9.700        97.33
GET       9.800        97.41
GET       9.900        97.54
GET      10.000        98.09
GET      11.000        98.67
GET      12.000        99.04
GET      13.000        99.28
GET      14.000        99.41
GET      15.000        99.51
GET      16.000        99.57
GET      17.000        99.62
GET      18.000        99.66
GET      19.000        99.70
GET      20.000        99.75
GET      21.000        99.79
GET      22.000        99.81
GET      23.000        99.85
GET      24.000        99.86
GET      25.000        99.87
GET      26.000        99.89
GET      27.000        99.90
GET      29.000        99.91
GET      30.000        99.93
GET      31.000        99.93
GET      32.000        99.95
GET      33.000        99.95
GET      38.000        99.96
GET      39.000        99.96
GET      49.000        99.97
GET      50.000        99.98
GET      53.000        99.98
GET      60.000        99.99
GET      62.000        99.99
GET      88.000       100.00
GET     120.000       100.00
---